{
  "af_ZA": 250027,
  "az_AZ": 250028,
  "bn_IN": 250029,
  "fa_IR": 250030,
  "gl_ES": 250052,
  "he_IL": 250031,
  "hr_HR": 250032,
  "id_ID": 250033,
  "ka_GE": 250034,
  "km_KH": 250035,
  "mk_MK": 250036,
  "ml_IN": 250037,
  "mn_MN": 250038,
  "mr_IN": 250039,
  "pl_PL": 250040,
  "ps_AF": 250041,
  "pt_XX": 250042,
  "sl_SI": 250053,
  "sv_SE": 250043,
  "sw_KE": 250044,
  "ta_IN": 250045,
  "te_IN": 250046,
  "th_TH": 250047,
  "tl_XX": 250048,
  "uk_UA": 250049,
  "ur_PK": 250050,
  "xh_ZA": 250051
}
